src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Редизайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРедизайна</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПерехода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереходаФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсключенияРедизайна</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Проекты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
Элементы.ИсключенияРедизайна.Видимость = Объект.Редизайн;
КонецПроцедуры

&НаКлиенте
Процедура РедизайнПриИзменении(Элемент)
Элементы.ИсключенияРедизайна.Видимость = Объект.Редизайн;
КонецПроцедуры

&НаКлиенте
Процедура ДатаРедизайнаПриИзменении(Элемент)
Объект.ДатаРедизайна = НачалоМесяца(Объект.ДатаРедизайна);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПереходаПриИзменении(Элемент)
Объект.ДатаПерехода = НачалоМесяца(Объект.ДатаПерехода);
КонецПроцедуры
